DataProcessors/СрезВерсийОбъектов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<DataProcessor>
		<Properties>
			<Name>СрезВерсийОбъектов</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Период</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РазмерПартии</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидОбъекта</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РежимРаботы</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РежимОбработки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПрекратитьРаботуЧерез</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

InformationRegisters/ВерсииОбъектов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ВерсииОбъектов</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ВерсияОбъекта</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>АвторВерсии</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаВерсии</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьСжато</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1024</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипВерсииОбъекта</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВерсияПроигнорирована</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Объект</Name>
					<Type>
						<v8:TypeSet>cfg:DocumentRef</v8:TypeSet>
						<v8:TypeSet>cfg:CatalogRef</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НомерВерсии</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

DataProcessors/СрезВерсийОбъектов/Ext/ObjectModule.bsl
////////////////////////////////////////////////////////////////////////////////
// ПЕРЕМЕННЫЕ МОДУЛЯ

Перем ОстановитьПосле;// Здесь будет дата и время, после которого обработка завершит работу
Перем ОграничениеПоВремени Экспорт;
Перем ФлагРаботы Экспорт;


////////////////////////////////////////////////////////////////////////////////
// ЭКСПОРТНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

Процедура ОчиститьРегистр(Индикатор = Неопределено) Экспорт
	
	Если РежимРаботы = 0 Тогда
		ВыполнитьСрезРегистра(Индикатор)
	ИначеЕсли РежимРаботы = 1 Тогда
		УдалитьВерсииСтарыхДокументов(Индикатор)
	ИначеЕсли РежимРаботы = 2 Тогда
		ВыполнитьОчисткуПоВидуОбъекта(Индикатор)
	КонецЕсли;

КонецПроцедуры


////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ОБЩЕГО НАЗНАЧЕНИЯ

Процедура ВыполнитьСрезРегистра(Индикатор = Неопределено)
	
	Интерактивно = Индикатор <> Неопределено;
	ОграничениеПоВремени = ПрекратитьРаботуЧерез <> 0;
	ОстановитьПосле = ТекущаяДата() + ПрекратитьРаботуЧерез;
	ФлагРаботы = Истина;
	
	Сообщить("Начало обработки:    "+ ТекущаяДата());
	
	Если РежимОбработки = 0 Тогда
		
		Массив = ПолучитьМассивОбъектовДляОбработки(Период);
		
		// Подготовка прогрессбара к работе
		Если Интерактивно Тогда
			
			Счетчик = 0;
			
			ОбщКолво = Массив.Количество();
			Индикатор.МинимальноеЗначение	= 0;
			КоличествоОбработанныхОбъектовДляОбновленияСтатуса = ?(ОбщКолво > 100, цел(ОбщКолво / 100), 1);
			Индикатор.Значение				= 0;
			Индикатор.МаксимальноеЗначение	= ?(ОбщКолво > 100, 100, ОбщКолво);
			
		КонецЕсли;
		
		Партия = Новый Массив;
		
		Для н = 0 По Массив.ВГраница() Цикл
			
			Если н % РазмерПартии = 0 Тогда
				
				ТаблицаВерсийОбъектов = ПолучитьПредыдущиеВерсииОбъектов(Партия, Период);
				УдалитьВерсииОбъектов(ТаблицаВерсийОбъектов);
				
				// Прекращаем работу, если время прошло
				Если ФлагРаботы = Ложь Тогда
					
					Сообщить("Работа прекращена по истечении времени", СтатусСообщения.Информация);
					//Перейти ~88
					Сообщить("Окончание обработки: "+ ТекущаяДата()); 
					Возврат;
					
				КонецЕсли;
				
				Партия.Очистить();
				
			КонецЕсли;
			
			Партия.Добавить(Массив[н]);
			
			ОбработкаПрерыванияПользователя();
			
			// Визуализация
			Если Интерактивно Тогда
				
				Если Счетчик % КоличествоОбработанныхОбъектовДляОбновленияСтатуса = 0 Тогда
					Индикатор.Значение = Индикатор.Значение + 1;
				КонецЕсли;
				
				Счетчик = Счетчик + 1;
				
			КонецЕсли;
			
		КонецЦикла;
		
		// Обработаем последнюю партию
		ТаблицаВерсийОбъектов = ПолучитьПредыдущиеВерсииОбъектов(Партия, Период);
		УдалитьВерсииОбъектов(ТаблицаВерсийОбъектов);
		
	ИначеЕсли РежимОбработки = 1 Тогда
		
		ТаблицаВерсийОбъектов = ПолучитьПредыдущиеВерсииОбъектов(, Период);
		
		Если Интерактивно Тогда
			УдалитьВерсииОбъектовИнтерактивно(ТаблицаВерсийОбъектов, Индикатор);
		Иначе
			УдалитьВерсииОбъектов(ТаблицаВерсийОбъектов);
		КонецЕсли;
		
	КонецЕсли;
	
//~88:
	Сообщить("Окончание обработки: " + ТекущаяДата());
	
КонецПроцедуры

Процедура УдалитьВерсииСтарыхДокументов(Индикатор)
	
	Предупреждение("Функционал в стадии разработки",, "Обработка очистки регистра версии объектов");

КонецПроцедуры

Процедура ВыполнитьОчисткуПоВидуОбъекта(Индикатор)
		
	Интерактивно = Индикатор <> Неопределено;
	ОграничениеПоВремени = ПрекратитьРаботуЧерез <> 0;
	ОстановитьПосле = ТекущаяДата() + ПрекратитьРаботуЧерез;
	ФлагРаботы = Истина;
	
	Сообщить("Начало обработки:    " + ТекущаяДата());
	
	Массив = ПолучитьМассивОбъектовДляОбработки(ВидОбъекта);
	
	// Подготовка прогрессбара к работе
	Если Интерактивно Тогда
		
		Счетчик = 0;
		
		ОбщКолво = Массив.Количество();
		Индикатор.МинимальноеЗначение	= 0;
		КоличествоОбработанныхОбъектовДляОбновленияСтатуса = ?(ОбщКолво > 100, цел(ОбщКолво / 100), 1);
		Индикатор.Значение				= 0;
		Индикатор.МаксимальноеЗначение	= ?(ОбщКолво > 100, 100, ОбщКолво);
		
	КонецЕсли;
	
	Для н = 0 По Массив.ВГраница() Цикл
		
		НаборЗаписей = РегистрыСведений.ВерсииОбъектов.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.Объект.Установить(Массив[н]);
		НаборЗаписей.Записать();
		
		// Прекращаем работу, если время прошло
		Если ОграничениеПоВремени И ТекущаяДата() > ОстановитьПосле Тогда
			
			Сообщить("Работа прекращена по истечению времени", СтатусСообщения.Информация);
			Возврат;
			
		КонецЕсли;
		
		ОбработкаПрерыванияПользователя();
		
		// Визуализация
		Если Интерактивно Тогда
			
			Если Счетчик % КоличествоОбработанныхОбъектовДляОбновленияСтатуса = 0 Тогда
				Индикатор.Значение = Индикатор.Значение + 1;
			КонецЕсли;
			
			Счетчик = Счетчик + 1;
			
		КонецЕсли;
		
	КонецЦикла;
	
//~88:
	Сообщить("Окончание обработки: " + ТекущаяДата());

КонецПроцедуры

Функция ПолучитьПредыдущиеВерсииОбъектов(Объекты = Неопределено, Период)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ВерсииОбъектов.Объект КАК Объект,
	|	ВерсииОбъектов.НомерВерсии
	|ИЗ
	|	РегистрСведений.ВерсииОбъектов КАК ВерсииОбъектов
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			ВерсииОбъектов.Объект КАК Объект,
	|			ВерсииОбъектов.ДатаВерсии КАК ПоследняяДатаВерсии,
	|			МАКСИМУМ(ВерсииОбъектов.НомерВерсии) КАК ПоследнийНомерВерсии
	|		ИЗ
	|			РегистрСведений.ВерсииОбъектов КАК ВерсииОбъектов
	|				ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|					ВерсииОбъектов.Объект КАК Объект,
	|					МАКСИМУМ(ВерсииОбъектов.ДатаВерсии) КАК ПоследняяДатаВерсии
	|				ИЗ
	|					РегистрСведений.ВерсииОбъектов КАК ВерсииОбъектов
	|				ГДЕ
	|					(&Период = ДАТАВРЕМЯ(1, 1, 1)
	|							ИЛИ ВерсииОбъектов.ДатаВерсии < &Период)
	|					И (&ВыбратьВсе
	|							ИЛИ ВерсииОбъектов.Объект В (&Объекты))
	|					И &ВидОбъекта
	|				
	|				СГРУППИРОВАТЬ ПО
	|					ВерсииОбъектов.Объект) КАК МаксДатаВерсии
	|				ПО ВерсииОбъектов.Объект = МаксДатаВерсии.Объект
	|					И ВерсииОбъектов.ДатаВерсии = МаксДатаВерсии.ПоследняяДатаВерсии
	|		ГДЕ
	|			(&Период = ДАТАВРЕМЯ(1, 1, 1)
	|					ИЛИ ВерсииОбъектов.ДатаВерсии < &Период)
	|			И (&ВыбратьВсе
	|					ИЛИ ВерсииОбъектов.Объект В (&Объекты))
	|		
	|		СГРУППИРОВАТЬ ПО
	|			ВерсииОбъектов.Объект,
	|			ВерсииОбъектов.ДатаВерсии) КАК ПоследняяВерсия
	|		ПО ВерсииОбъектов.Объект = ПоследняяВерсия.Объект
	|			И ВерсииОбъектов.НомерВерсии < ПоследняяВерсия.ПоследнийНомерВерсии
	|			И ВерсииОбъектов.ДатаВерсии <= ПоследняяВерсия.ПоследняяДатаВерсии";
	
	// Устанавливаем параметры
	Запрос.УстановитьПараметр("Период", Период);
	Запрос.УстановитьПараметр("Объекты", Объекты);
	Запрос.УстановитьПараметр("ВыбратьВсе", Объекты = Неопределено);
	
	// Установим в запросе вид объекта, если надо
	Если ПустаяСтрока(ВидОбъекта) Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "И &ВидОбъекта", "");
	Иначе
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "И &ВидОбъекта", "И ВерсииОбъектов.Объект ССЫЛКА " + ВидОбъекта);
	КонецЕсли;
	
	Таблица=Запрос.Выполнить().Выгрузить();
	
    Возврат Таблица
	
КонецФункции

Функция ПолучитьМассивОбъектовДляОбработки(ПериодТип)
	
	МассивОбъектов = Новый Массив;
	
	Запрос = Новый Запрос;
	
	Если ТипЗнч(ПериодТип) = Тип("Дата") Тогда
		
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВерсииОбъектов.Объект,
		|	КОЛИЧЕСТВО(ВерсииОбъектов.Объект) КАК Количество
		|ИЗ
		|	РегистрСведений.ВерсииОбъектов КАК ВерсииОбъектов
		|ГДЕ
		|	(&Период = ДАТАВРЕМЯ(1, 1, 1)
		|			ИЛИ ВерсииОбъектов.ДатаВерсии < &Период)
		|
		|СГРУППИРОВАТЬ ПО
		|	ВерсииОбъектов.Объект
		|
		|ИМЕЮЩИЕ
		|	КОЛИЧЕСТВО(ВерсииОбъектов.Объект) > 1";
		
		// Устанавливаем параметры
		Запрос.УстановитьПараметр("Период", ПериодТип);
		
		МассивОбъектов = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Объект");
		
	ИначеЕсли ТипЗнч(ПериодТип) = Тип("Строка") Тогда
		
		Запрос.Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ВерсииОбъектов.Объект
		|ИЗ
		|	РегистрСведений.ВерсииОбъектов КАК ВерсииОбъектов
		|ГДЕ
		|	&ВидОбъекта";
		
		// Установим в запросе вид объекта, если надо
		Если ПустаяСтрока(ВидОбъекта) Тогда
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ВидОбъекта", "");
		Иначе
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ВидОбъекта", "ВерсииОбъектов.Объект ССЫЛКА " + ПериодТип);
		КонецЕсли;
		
		МассивОбъектов = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Объект");
		
	КонецЕсли;
	
	Возврат МассивОбъектов;
		
КонецФункции

Процедура УдалитьВерсииОбъектов(ТаблицаВерсий)
	
	Запись = РегистрыСведений.ВерсииОбъектов.СоздатьМенеджерЗаписи();
	
	Для Каждого	СтрокаТЗ Из ТаблицаВерсий Цикл
		
		Запись.Объект		= СтрокаТЗ.Объект;
		Запись.НомерВерсии	= СтрокаТЗ.НомерВерсии;
		Запись.Прочитать();
		
		Если Запись.Выбран() Тогда
			Запись.Удалить();
		КонецЕсли;
		
		// Прекратим работу, если стоит ограничение по времени
		Если ОграничениеПоВремени Тогда
			
			Если ТекущаяДата() > ОстановитьПосле Тогда
				
				ФлагРаботы = Ложь;
				Возврат;
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;

КонецПроцедуры

Процедура УдалитьВерсииОбъектовИнтерактивно(ТаблицаВерсий, Индикатор)
	
	Запись = РегистрыСведений.ВерсииОбъектов.СоздатьМенеджерЗаписи();
	
	// Подготовка прогрессбара к работе
	Счетчик = 0;
	ОбщКолво = ТаблицаВерсий.Количество();
	Индикатор.МинимальноеЗначение	= 0;
	КоличествоОбработанныхОбъектовДляОбновленияСтатуса = ?(ОбщКолво > 100, цел(ОбщКолво / 100), 1);
	Индикатор.Значение				= 0;
	Индикатор.МаксимальноеЗначение	= ?(ОбщКолво > 100, 100, ОбщКолво);
	
	Для Каждого	СтрокаТЗ Из ТаблицаВерсий Цикл
		
		Запись.Объект		= СтрокаТЗ.Объект;
		Запись.НомерВерсии	= СтрокаТЗ.НомерВерсии;
		Запись.Прочитать();
		
		Если Запись.Выбран() Тогда
			Запись.Удалить();
		КонецЕсли;
		
		ОбработкаПрерыванияПользователя();
			
		// Визуализация
		Если Счетчик % КоличествоОбработанныхОбъектовДляОбновленияСтатуса = 0 Тогда
			Индикатор.Значение = Индикатор.Значение + 1;
		КонецЕсли;
		
		// Прекратим работу, если стоит ограничение по времени
		Если ОграничениеПоВремени Тогда
			
			Если ТекущаяДата() > ОстановитьПосле Тогда
				
				Сообщить("Работа прекращена по истечению времени", СтатусСообщения.Информация);
				Возврат;
				
			КонецЕсли;
			
		КонецЕсли;
		
		Счетчик = Счетчик + 1;
		
	КонецЦикла;
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ОПЕРАТОРЫ ОСНОВНОЙ ПРОГРАММЫ
